#include <stdio.h>
#include <math.h>

int main(int argc, char **argv){
	int i, j, N, pos_size=0, even_size=0;
	float sum=0, neg_prod=0; 
	do{
		printf("\n-==========================================-\n");
		printf(" Παρακαλώ εισάγετε το πλήθος των στοιχείων: ");
		scanf("%d", &N);
		printf("-==========================================-\n");
	}while(N < 0);
	//Ο παραπάνω βρόγχος εκτελείται με σκοπό την αποφυγή του "segmentation fault".
	float arr[N];
	
	for(i=0; i<N; i++){
		printf("\nΠαρακαλώ εισάγετε αριθμό: ");
		scanf("%f", &arr[i]);
		
		if(arr[i] < 0){
			if(neg_prod == 0)
				neg_prod = arr[i];
			else
				neg_prod*=arr[i];
			arr[i] = -arr[i];
			if(fmod(arr[i], 2) == 1){
				printf("\n-===================================================-\n");
				printf(" Το τετράγωνο του %dου αριθμού, -%.0f, είναι: %.0f\n", i+1, arr[i], arr[i]*arr[i]);
				printf("-===================================================-\n");
			}
			else
				even_size++;
			arr[i] = -arr[i];
		}
		else{
			sum+=arr[i]; //Προσωρινή αποθήκευση αθροισματος στην "sum".
			pos_size++;
			if(fmod(arr[i], 2) == 1){
				printf("\n-===================================================-\n");
				printf(" Το τετράγωνο του %dου αριθμού, %.0f, είναι: %.0f\n", i+1, arr[i], arr[i]*arr[i]);
				printf("-===================================================-\n");
			}
			else
				even_size++;
		}
	}
	
	sum /= pos_size; //Αφού υπολογιστεί το άθροισμα όλων των θετικών αριθμών, το διαιρούμε με τον αριθμό του συνόλου των θετικών για να πάρουμε το μέσο όρο.
	printf("\n-==================================================-\n");
	printf("  Ο μέσος όρος των θετικών αριθμών είναι: %.2f\n", sum);
	printf("  Το γινόμενο των αρνητικών αριθμών είναι: %.1f", neg_prod);
	printf("\n-==================================================-\n\n");
	
	
	printf("\n-==========================================-\n");
	printf("  Το πλήθος των άρτιων αριθμών είναι: %d", even_size);
	printf("\n-==========================================-\n");
	return 0;
}