#include <stdio.h>
#include <math.h>

int main(){
	float a, b, c, x1, x2, D;
	printf("Το ακόλουθο πρόγραμμα λύνει την εξής εξίσωση: 'α*x^2+β*x+γ=0'.\n");
	printf("Παρακαλώ εισάγετε τη τιμή για το 'α': ");
	scanf("%f", &a);
	printf("Παρακαλώ εισάγετε τη τιμή για το 'β': ");
	scanf("%f", &b);
	printf("Παρακαλώ εισάγετε τη τιμή για το 'γ': ");
	scanf("%f", &c);
	if(a == 0){
		if(b == 0){
			if(c==0){
				printf("\n-========================-");
				printf("\n Η εξίσωση είναι αόριστη!");
				printf("\n-========================-\n");
				//return 0;
			}
			else{
				printf("\n-========================-");
				printf("\n Η εξίσωση είναι αδύνατη!");
				printf("\n-========================-\n");
				//return 0;
			}
		}
		else{
			x1 = ((c - (c*2))/b); //Η λύση της εξίσωσης είναι -γ/β οπότε αφαιρούμε τον διπλάσιο του γ από τον εαυτό της, διαιρούμε με το β και αποθηκεύουμε το αποτέλεσμα στη x1
			printf("\n-================================-");
			printf("\n Η λύση της εξίσωσης είναι: %.2f", x1); 
			printf("\n-================================-\n");
		}
	}
	else{
		D = ((b*b)-(4*a*c));
		b -= (b*2); //Μετατρέπουμε το β σε -β για την επίλυση της εξίσωσης.
		if(D > 0){
			x1 = ((b + sqrt(D)) / 2*a);
			x2 = ((b - sqrt(D)) / 2*a);
			printf("\n-=======================================================-");
			printf("\n   Οι λύσεις της εξίσωσης είναι: x1=%.2f και x2=%.2f", x1, x2);
			printf("\n-=======================================================-\n");
		}
		else if(D == 0){
			x1 = (b / (2*a));
			printf("\n-=======================================-");
			printf("\n  Οι λύση της εξίσωσης είναι: x1=%.2f", x1);
			printf("\n-=======================================-\n");
		}
		else{
			printf("\n-========================-");
			printf("\n Η εξίσωση είναι αδύνατη!");
			printf("\n-========================-\n");
		}
		
	}
	return 0;
}